## staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 1 to change, 4 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                      NAME                                      |
|----------|--------------------------------------------------------------------------------|
| update   | `aws_cloudwatch_metric_alarm.service-callback-too-many-failures-critical[0]`   |
| recreate | `aws_secretsmanager_secret_version.pr_bot_private_key`                         |
|          | `module.vpn.aws_ec2_client_vpn_authorization_rule.this_subnets[&quot;10.0.0.0/24&quot;]` |
|          | `module.vpn.aws_ec2_client_vpn_authorization_rule.this_subnets[&quot;10.0.1.0/24&quot;]` |
|          | `module.vpn.aws_ec2_client_vpn_authorization_rule.this_subnets[&quot;10.0.2.0/24&quot;]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.service-callback-too-many-failures-critical[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "service-callback-too-many-failures-critical" {
      ~ alarm_actions                         = [
          - "arn:aws:sns:ca-central-1:239043911459:alert-warning",
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      ~ alarm_description                     = "Service reached the max number of callback retries 25 times in 5 minutes" -> "Service reached the max number of callback retries 100 times in 10 minutes"
        id                                    = "service-callback-too-many-failures-warning"
      ~ period                                = 300 -> 600
        tags                                  = {}
      ~ threshold                             = 25 -> 100
        # (18 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.pr_bot_private_key must be replaced
-/+ resource "aws_secretsmanager_secret_version" "pr_bot_private_key" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:PR_BOT_PRIVATE_KEY-EIUsAp" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:PR_BOT_PRIVATE_KEY-EIUsAp|terraform-20240318133723242600000006" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "terraform-20240318133723242600000006" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.vpn.aws_ec2_client_vpn_authorization_rule.this_subnets["10.0.0.0/24"] must be replaced
-/+ resource "aws_ec2_client_vpn_authorization_rule" "this_subnets" {
      ~ access_group_id        = (sensitive value) # forces replacement
      - authorize_all_groups   = false -> null
      ~ id                     = "cvpn-endpoint-09a79e8845a82dbf3,10.0.0.0/24,cc6df538-30e1-7031-2571-1ac0a5bbc5dc" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.vpn.aws_ec2_client_vpn_authorization_rule.this_subnets["10.0.1.0/24"] must be replaced
-/+ resource "aws_ec2_client_vpn_authorization_rule" "this_subnets" {
      ~ access_group_id        = (sensitive value) # forces replacement
      - authorize_all_groups   = false -> null
      ~ id                     = "cvpn-endpoint-09a79e8845a82dbf3,10.0.1.0/24,cc6df538-30e1-7031-2571-1ac0a5bbc5dc" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.vpn.aws_ec2_client_vpn_authorization_rule.this_subnets["10.0.2.0/24"] must be replaced
-/+ resource "aws_ec2_client_vpn_authorization_rule" "this_subnets" {
      ~ access_group_id        = (sensitive value) # forces replacement
      - authorize_all_groups   = false -> null
      ~ id                     = "cvpn-endpoint-09a79e8845a82dbf3,10.0.2.0/24,cc6df538-30e1-7031-2571-1ac0a5bbc5dc" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 4 to add, 1 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acmpca_certificate_authority.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common...
```

</details>
